[
  {
    "name": "disarm",
    "title": "DiSARM",
    "short_description": "A spatial intelligence tool, built to enable disease control programs to deliver more effective field campaigns.",
    "image": "1.png",
    "images": [
      "1.png",
      "2.png"
    ],
    "description": "<p><a href=\"https://disarm.io\">DiSARM</a> is a spatial intelligence tool, built to enable disease control programs to deliver more effective field campaigns. It is currently being used to fight malaria in Botswana, Namibia, Zimbabwe and Swaziland. The project is supported by Bill and Melinda Gates Foundation, Clinton Health Access Initiative and Google.</p><p>There are two teams on the project: a data science team and a software development team. The data science team writes models for predicting things like roof types of buildings, sprayable/unsprayable structures and risk of contracting malaria for a given area. The development team builds software that support these models.</p><p>I work on the development team where we write software to support spray campaigns. The main piece of work has been creating DOUMA (DiSARM Offline Universal Mobile Application).</p><p>DOUMA allow the malaria programs to plan their campaigns ahead of time and gives them estimates on number of structures in the areas they want to spray. After planning, the spray teams can then collect data as they are spraying houses. Once data has been collected, it is all synced to a dashboard that provide the malaria programs with statistics on their spraying effors.</p><p>All of this works offline as the network connection can be quite patchy in the areas they are spraying. The frontend was therefore built as a Progressive Web App with Vue, to take advantage of the offline functionality of service workers. The backend is built with NodeJS and Mongo.</p><p>The code is open source and available on the <a href=\"http://github.com/disarm-platform\">github page</a>.</p>"
  },
  {
    "name": "fairstart",
    "title": "Fairstart Foundation Application",
    "short_description": "Offline course application for Mac and Windows.",
    "image": "1.png",
    "images": [
      "1.png",
      "2.png",
      "3.png"
    ],
    "description": "<p>Fairstart Foundation has created a set of courses in early childhoold development primarily for caregivers working at orphanages. The courses are available online at their <a href=\"http: //fairstartfoundation.com/\">website</a>.</p><p>The courses have been taught in more than 20 countries. Some of these countries have very poor internet connections. This means they cannot access the online version. </p> <p>The Fairstart Foundation offline application allow their courses to be taught in these areas. The application has all the content of the online versions: text, images and even videoes. It features a simple design that allows for easy navigation. </p> <p>The first version was made in collaboration with SOS Children's Villages in three language: Kinyarwanda, Swahili and English. </p> <p>The latest version for Greenland was made in collaboration with the Greenland Social authorities. This version features two new languages: Danish and Greenlandic.</p><p> It was recently featured in a danish newspaper, read the article <a href=\"http://e-pages.dk/btmetro/78/html5/11/\">here</a>.</p><p>The application is built with Vue and Electron and is available on Mac, Windows and Linux. </p><p>"
  },
  {
    "name": "waterford",
    "title": "Waterford Kamhlaba",
    "short_description": "The official website for Waterford Kamhlaba UWCSA.",
    "image": "1.png",
    "images": [
      "1.png",
      "2.png",
      "3.png"
    ],
    "description": "<p>The Waterford website was built as part of a community service project during my time at Waterford Kamhlaba. The old site was in desperate need of a upgrade, both visually and functionally.</p><p>A fellow student and I took initiative to design and build a new website from scratch.</p><p>When the design was finished I put the site together and integrated it with a content management system.</p><p>The new site is optimised for search engines and social media sharing.</p><p><b>Update April 2018</b>: Please note the site has been replaced as part of a change in the communications department.</p>"
  },
  {
    "name": "emoyeni",
    "title": "Emoyeni",
    "short_description": "Using USSD codes in a straight forward and easy way.",
    "image": "1.png",
    "images": [
      "1.png",
      "2.png",
      "3.png",
      "4.png",
      "5.png"
    ],
    "description": "<p>Emoyeni was created out of frustation of using USSD codes. USSD codes are used to recharge prepaid sim cards among other things and look like: *555# or can be as long as *141*3*2*78413521#.</p><p>Emoyeni makes it a lot simpler to use them: it gives the user an interface with actual buttons. With Emoyeni prepaid sim users can recharge airtime, send data to their friends, use mobile banking and much more. </p><p>The app works completely offline and it is even possible to send the app to other users using bluetooth from within the app itself.</p></p>Emoyeni has gone through several iterations, this being the third version.</p><p>During the 2017 MTN Apps Challenge, Emoyeni won a second place. </p><p>Emoyeni has been featured in the local news several times. Read an article by the Times of Swaziland <a href=\"/images/emoyeni/article.jpg\">here</a>.</p> <p>Download Emoyeni on the <a href=\"https://play.google.com/store/apps/details?id=io.nicolai.emoyeni\">Google Play store.</a></p>"
  },
  {
    "name": "kingsapp",
    "title": "Kings Office App",
    "short_description": "A gift to his Majesty King Mswati III.",
    "image": "1.png",
    "images": [
      "1.png",
      "2.png",
      "3.png",
      "4.png",
      "5.png"
    ],
    "description": "<p>The Kings Office app was created as a gift for His Majesty King Mswati III for his 48th birthday. </p><p>The app allows the Kings Office to send push notifications and messages regarding official royal events. </p><p>The app was available in siSwati and English. It was the first application made entirely in siSwati. </p><p>As part of the development I had to write a translation for the popular open source library moment.js to get the dates to show in siSwati. Read more about <a href=\"/projects/momentjs\">my momentjs contribution</a>.</p><p>The gift was recognised in the Times of Swaziland. <a href=\"/images/kingsapp/article.jpg\">See more here.</a></p>"
  },
  {
    "name": "hipnotik",
    "title": "Hipnotik App",
    "short_description": "A mobile app for Swaziland biggest Hip Hop Festival.",
    "image": "1.png",
    "images": [
      "1.png",
      "2.png",
      "3.png",
      "4.png"
    ],
    "description": "<p>Hipnotik is Swazilands biggest Hip Hop festival created by a young team of entrepreneurs at Swazijive.</p><p>They needed an app to accompany the festival that matched their brand. The Hipnotik Mobile app was the first mobile app for a festival in Swaziland. </p><p>It has the shows lineup, artist profiles, social media integration and drink prices. </p><p>The first version was created for Hipnotik 2015, it was completely revamped for Hipnotik 2016.</p><p>Download the app on <a href=\"https: //play.google.com/store/apps/details?id=io.nicolai.hipnotik\">Google Play Store</a>.</p>"
  },
  {
    "name": "momentjs",
    "title": "moment.js siSwati Translation",
    "short_description": "A siSwati translation for the popular open source library moment.js.",
    "image": "1.png"
  }
]
